Repository: mishrafabric/cmux
Catalog: webviews/src/pages/diff/Localizable.xcstrings
Source language: en
Languages: ar, bs, da, de, es, fr, it, ja, km, ko, nb, pl, pt_br, ru, th, tr, uk, vi, zh_hans, zh_hant

# diffViewer.richPreview
source: Rich preview
ar: معاينة منسقة
bs: Obogaćeni pregled
da: Udvidet forhåndsvisning
de: Formatierte Vorschau
es: Vista previa enriquecida
fr: Aperçu enrichi
it: Anteprima avanzata
ja: リッチプレビュー
km: ការមើលជាមុនសម្បូរបែប
ko: 서식 있는 미리보기
nb: Utvidet forhåndsvisning
pl: Podgląd rozszerzony
pt_br: Prévia avançada
ru: Расширенный предпросмотр
th: ตัวอย่างแบบสมบูรณ์
tr: Zengin önizleme
uk: Розширений попередній перегляд
vi: Xem trước phong phú
zh_hans: 富文本预览
zh_hant: 豐富預覽

# diffViewer.showBackgrounds
source: Show backgrounds
ar: إظهار الخلفيات
bs: Prikaži pozadine
da: Vis baggrunde
de: Hintergründe anzeigen
es: Mostrar fondos
fr: Afficher les arrière-plans
it: Mostra sfondi
ja: 背景色を表示
km: បង្ហាញផ្ទៃខាងក្រោយ
ko: 배경 표시
nb: Vis bakgrunner
pl: Pokaż tła
pt_br: Mostrar fundos
ru: Показать фон
th: แสดงพื้นหลัง
tr: Arka planları göster
uk: Показати тло
vi: Hiển thị nền
zh_hans: 显示背景
zh_hant: 顯示背景

# diffViewer.showFileSearch
source: Show file search
ar: إظهار بحث الملفات
bs: Prikaži pretragu datoteka
da: Vis filsøgning
de: Dateisuche anzeigen
es: Mostrar búsqueda de archivos
fr: Afficher la recherche de fichiers
it: Mostra ricerca file
ja: ファイル検索を表示
km: បង្ហាញការស្វែងរកឯកសារ
ko: 파일 검색 표시
nb: Vis filsøk
pl: Pokaż wyszukiwanie plików
pt_br: Mostrar busca de arquivos
ru: Показать поиск файлов
th: แสดงการค้นหาไฟล์
tr: Dosya aramasını göster
uk: Показати пошук файлів
vi: Hiển thị tìm kiếm tệp
zh_hans: 显示文件搜索
zh_hant: 顯示檔案搜尋

# diffViewer.showFiles
source: Show files
ar: إظهار الملفات
bs: Prikaži datoteke
da: Vis filer
de: Dateien anzeigen
es: Mostrar archivos
fr: Afficher les fichiers
it: Mostra file
ja: ファイルを表示
km: បង្ហាញឯកសារ
ko: 파일 표시
nb: Vis filer
pl: Pokaż pliki
pt_br: Mostrar arquivos
ru: Показать файлы
th: แสดงไฟล์
tr: Dosyaları göster
uk: Показати файли
vi: Hiển thị tệp
zh_hans: 显示文件
zh_hant: 顯示檔案

# diffViewer.showLineNumbers
source: Show line numbers
ar: إظهار أرقام الأسطر
bs: Prikaži brojeve redova
da: Vis linjenumre
de: Zeilennummern anzeigen
es: Mostrar números de línea
fr: Afficher les numéros de ligne
it: Mostra numeri di riga
ja: 行番号を表示
km: បង្ហាញលេខបន្ទាត់
ko: 줄 번호 표시
nb: Vis linjenumre
pl: Pokaż numery wierszy
pt_br: Mostrar números de linha
ru: Показать номера строк
th: แสดงหมายเลขบรรทัด
tr: Satır numaralarını göster
uk: Показати номери рядків
vi: Hiển thị số dòng
zh_hans: 显示行号
zh_hant: 顯示行號

# diffViewer.showViewedFiles
source: Show viewed files
ar: إظهار الملفات التي تمت مشاهدتها
bs: Prikaži pregledane datoteke
da: Vis sete filer
de: Angesehene Dateien anzeigen
es: Mostrar archivos vistos
fr: Afficher les fichiers vus
it: Mostra i file visti
ja: 確認済みファイルを表示
km: បង្ហាញឯកសារដែលបានមើល
ko: 확인한 파일 표시
nb: Vis sette filer
pl: Pokaż obejrzane pliki
pt_br: Mostrar arquivos vistos
ru: Показать просмотренные файлы
th: แสดงไฟล์ที่ดูแล้ว
tr: Görülen dosyaları göster
uk: Показати переглянуті файли
vi: Hiện tệp đã xem
zh_hans: 显示已查看的文件
zh_hant: 顯示已檢視的檔案

# diffViewer.sourceBranch
source: Branch
ar: الفرع
bs: Grana
es: Rama
fr: Branche
ja: ブランチ
km: សាខា
ko: 브랜치
pl: Gałąź
ru: Ветка
th: แบรนช์
tr: Dal
uk: Гілка
vi: Nhánh
zh_hans: 分支
zh_hant: 分支

# diffViewer.sourceCommitted
source: Committed
ar: مُودَعة
bs: Komitovano
da: Committet
de: Committet
es: Confirmados
fr: Validées
it: Committate
ja: コミット済み
km: បាន commit
ko: 커밋됨
nb: Committet
pl: Zatwierdzone
pt_br: Commitadas
ru: Зафиксированные
th: คอมมิตแล้ว
tr: Commit edilmiş
uk: Зафіксовані
vi: Đã commit
zh_hans: 已提交
zh_hant: 已提交

# diffViewer.sourceLastTurn
source: Last Turn
ar: الدور الأخير
bs: Posljednji potez
da: Seneste tur
de: Letzter Durchgang
es: Último turno
fr: Dernier tour
it: Ultimo turno
ja: 直前のターン
km: វេនចុងក្រោយ
ko: 마지막 턴
nb: Siste tur
pl: Ostatnia tura
pt_br: Último turno
ru: Последний ход
th: รอบล่าสุด
tr: Son tur
uk: Останній хід
vi: Lượt cuối
zh_hans: 上一轮
zh_hant: 上一輪

# diffViewer.sourceNoCommits
source: No commits to show
ar: لا توجد إيداعات لعرضها
bs: Nema commitova za prikaz
da: Ingen commits at vise
de: Keine Commits vorhanden
es: No hay commits para mostrar
fr: Aucun commit à afficher
it: Nessun commit da mostrare
ja: 表示するコミットがありません
km: គ្មាន commit ដើម្បីបង្ហាញ
ko: 표시할 커밋이 없습니다
nb: Ingen commits å vise
pl: Brak commitów do wyświetlenia
pt_br: Nenhum commit para mostrar
ru: Нет коммитов для отображения
th: ไม่มีคอมมิตที่จะแสดง
tr: Gösterilecek commit yok
uk: Немає комітів для відображення
vi: Không có commit để hiển thị
zh_hans: 没有可显示的提交
zh_hant: 沒有可顯示的提交

# diffViewer.sourceStaged
source: Staged
ar: مُجهَّزة
bs: U stageu
de: Gestaged
es: Preparados
fr: Indexées
it: In stage
ja: ステージ済み
km: បាន stage
ko: 스테이징됨
nb: Staget
pl: W indeksie
pt_br: Preparadas
ru: В индексе
th: stage แล้ว
tr: Hazırlanmış
uk: В індексі
vi: Đã stage
zh_hans: 已暂存
zh_hant: 已暫存

# diffViewer.sourceUncommitted
source: Uncommitted
ar: غير مُودَعة
bs: Nekomitovano
da: Ikke committet
de: Nicht committet
es: Sin confirmar
fr: Non validées
it: Non committate
ja: 未コミット
km: មិនទាន់ commit
ko: 커밋 안 됨
nb: Ikke committet
pl: Niezatwierdzone
pt_br: Não commitadas
ru: Незафиксированные
th: ยังไม่คอมมิต
tr: Commit edilmemiş
uk: Незафіксовані
vi: Chưa commit
zh_hans: 未提交
zh_hant: 未提交

# diffViewer.sourceUnstaged
source: Unstaged
ar: غير مُجهَّزة
bs: Nije u stageu
da: Ikke staged
de: Nicht gestaged
es: Sin preparar
fr: Non indexées
it: Non in stage
ja: 未ステージ
km: មិនទាន់ stage
ko: 스테이징 안 됨
nb: Ikke staget
pl: Niedodane do indeksu
pt_br: Não preparadas
ru: Не в индексе
th: ยังไม่ stage
tr: Hazırlanmamış
uk: Не в індексі
vi: Chưa stage
zh_hans: 未暂存
zh_hant: 未暫存

# diffViewer.switchToSplitDiff
source: Switch to split diff
ar: التبديل إلى تقسيم الفروقات
bs: Prebaci na podijeljeni diff
da: Skift til delt diff
de: Zu geteilter Aufteilung wechseln
es: Cambiar a diff dividido
fr: Passer au diff divisé
it: Passa al diff diviso
ja: 分割表示に切り替え
km: ប្តូរទៅ diff បំបែក
ko: 분할 뷰로 전환
nb: Bytt til delt diff
pl: Przełącz na diff podzielony
pt_br: Mudar para diff dividido
ru: Переключить на разделённый diff
th: สลับเป็น diff แบบแยก
tr: Bölünmüş diff’e geç
uk: Перемкнути на розділений diff
vi: Chuyển sang split diff
zh_hans: 切换到分栏差异
zh_hant: 切換至分割差異

# diffViewer.switchToUnifiedDiff
source: Switch to unified diff
ar: التبديل إلى الفروقات الموحدة
bs: Prebaci na jedinstveni diff
da: Skift til samlet diff
de: Zu zusammengeführtem Diff wechseln
es: Cambiar a diff unificado
fr: Passer au diff unifié
it: Passa al diff unificato
ja: 統合表示に切り替え
km: ប្តូរទៅ diff រួម
ko: 통합 뷰로 전환
nb: Bytt til samlet diff
pl: Przełącz na diff ujednolicony
pt_br: Mudar para diff unificado
ru: Переключить на унифицированный diff
th: สลับเป็น diff แบบรวม
tr: Birleşik diff’e geç
uk: Перемкнути на уніфікований diff
vi: Chuyển sang unified diff
zh_hans: 切换到统一差异
zh_hant: 切換至合併差異

# diffViewer.untitled
source: Untitled
ar: بلا عنوان
bs: Bez naslova
da: Uden titel
de: Unbenannt
es: Sin título
fr: Sans titre
it: Senza titolo
ja: 無題
km: គ្មានចំណងជើង
ko: 제목 없음
nb: Uten tittel
pl: Bez tytułu
pt_br: Sem título
ru: Без названия
th: ไม่มีชื่อ
tr: Adsız
uk: Без назви
vi: Chưa đặt tên
zh_hans: 未命名
zh_hant: 未命名

# diffViewer.viewed
source: Viewed
ar: تمت المشاهدة
bs: Pregledano
da: Set
de: Angesehen
es: Visto
fr: Vu
it: Visto
ja: 確認済み
km: បានមើល
ko: 확인함
nb: Sett
pl: Obejrzane
pt_br: Visto
ru: Просмотрено
th: ดูแล้ว
tr: Görüldü
uk: Переглянуто
vi: Đã xem
zh_hans: 已查看
zh_hant: 已檢視

# diffViewer.wordDiffs
source: Word diffs
ar: فروق الكلمات
bs: Razlike po riječima
da: Ordforskelle
de: Wortunterschiede
es: Diferencias por palabra
fr: Différences par mot
it: Differenze per parola
ja: 単語単位の差分
km: ភាពខុសគ្នាតាមពាក្យ
ko: 단어 단위 차이
nb: Ordforskjeller
pl: Różnice słów
pt_br: Diferenças por palavra
ru: Различия по словам
th: ความแตกต่างระดับคำ
tr: Sözcük farkları
uk: Відмінності за словами
vi: Khác biệt theo từ
zh_hans: 词级差异
zh_hant: 單字差異

# diffViewer.wordWrap
source: Word wrap
ar: التفاف النص
bs: Prelamanje riječi
da: Ordombrydning
de: Zeilenumbruch
es: Ajuste de línea
fr: Retour à la ligne
it: A capo automatico
ja: 折り返し
km: ការបង្វិលពាក្យ
ko: 자동 줄 바꿈
nb: Tekstbryting
pl: Zawijanie wierszy
pt_br: Quebra de linha
ru: Перенос строк
th: ตัดคำ
tr: Sözcük kaydırma
uk: Перенесення рядків
vi: Tự động ngắt dòng
zh_hans: 自动换行
zh_hant: 自動換行
